#### Terraform fmt for dev `success`
#### Terraform init for dev `success`
#### Terraform validate for dev `success`
#### Terraform plan for dev `success`

<details><summary>Show plan result for dev </summary>

```

provision
random_password.vm_password: Refreshing state... [id=none]
proxmox_virtual_environment_download_file.debian_12_cloud_image: Refreshing state... [id=local:iso/debian_12_cloud_image.img]
proxmox_virtual_environment_vm.debian_vm: Refreshing state... [id=100]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.debian_12_cloud_image must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image" {
      ~ file_name      = "debian_12_cloud_image.img" -> "debian_12_cloud_image-dev.img" # forces replacement
      ~ id             = "local:iso/debian_12_cloud_image.img" -> (known after apply)
      ~ size           = 379663872 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_vm.debian_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "debian_vm" {
      ~ id                      = "100" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:D7:96:16",
        ] -> (known after apply)
        name                    = "dev"
      ~ network_interface_names = [] -> (known after apply)
      - tags                    = [] -> null
        # (21 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ file_id           = "local:iso/debian_12_cloud_image.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-100-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface    = "ide2" -> null
            # (1 unchanged attribute hidden)

          ~ user_account {
              ~ password = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (2 unchanged blocks hidden)
        }

      ~ network_device {
          ~ mac_address = "BC:24:11:D7:96:16" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*